"""
Практическое задание по уроку "Строки и индексация строк".
Цель: научиться работать со строками и индексацией строк в Python.
"""

example = 'Программирование'

print(example[0])  # выводим первый символ строки
print(example[-1])  # выводим последний символ строки (используя отрицательный индекс)
print(example[7:])  # выводим вторую половину строки (с нечетным количеством символов)
print(example[::-1])  # выводим строку наоборот
print(example[1::2])  # выводим каждый второй символ строки
