"""
Практическая работа по уроку "Динамическая типизация".
Цель: написать программу на языке Python, используя PyCharm, для демонстрации динамической типизации.
"""

name = 'Konstantin'
print(name)

age = 38
print(age)

age = age + 1
print(age)

is_student = True
print(is_student)
